cases/BFS/example/0/fluid/T.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            compressible::turbulentTemperatureTwoPhaseRadCoupledMixedBiot;
        value           $internalField;
        Tnbr            T;
        kappaMethod     phaseSystem;
        region           fluid;
        otherPhase      liquid;
	    qrNbr		    none;
    	qr		        none;

    }
}


// ************************************************************************* //
