cases/BFS/example/0/fluid/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 1 0 0 );

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            noSlip;
    }
    inlet
		{
				type	 fixedValue;
 				 value 	 nonuniform List<vector>
    10
(
(0.28500000000000003 0 0) 
(0.7650000000000001 0 0) 
(1.125 0 0) 
(1.3649999999999998 0 0) 
(1.485 0 0) 
(1.4849999999999999 0 0) 
(1.3650000000000002 0 0) 
(1.125 0 0) 
(0.7650000000000006 0 0) 
(0.28499999999999925 0 0) 
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
