cases/BFS/example/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory  

# Source tutorial run function
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication $application
