cases/BFS/example/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 3;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
        minIter         2;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
  "(U.*|h.*|e.*)"
    {   
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-12;
        relTol           0;
        minIter          1;
    }   

    "(U.*|h.*|e.*)Final"
    {   
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-10;
        relTol           0;
    }   

    Yi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
        residualAlpha   1e-8;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors   2;
    faceMomentum        no;
}


// ************************************************************************* //
